fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
//*****************************************************************************
//
// hw_usb.h - Macros for use in accessing the USB registers.
//
// Copyright (c) 2007-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __HW_USB_H__
#define __HW_USB_H__

//*****************************************************************************
//
// The following are defines for the Univeral Serial Bus register offsets.
//
//*****************************************************************************
#define USB_O_FADDR       0x00000000 // USB Device Functional Address
#define USB_O_POWER       0x00000001 // USB Power
#define USB_O_TXIS        0x00000002 // USB Transmit Interrupt Status
#define USB_O_RXIS        0x00000004 // USB Receive Interrupt Status
#define USB_O_TXIE        0x00000006 // USB Transmit Interrupt Enable
#define USB_O_RXIE        0x00000008 // USB Receive Interrupt Enable
#define USB_O_IS          0x0000000A // USB General Interrupt Status
#define USB_O_IE          0x0000000B // USB Interrupt Enable
#define USB_O_FRAME       0x0000000C // USB Frame Value
#define USB_O_EPIDX       0x0000000E // USB Endpoint Index
#define USB_O_TEST        0x0000000F // USB Test Mode
#define USB_O_FIFO0       0x00000020 // USB FIFO Endpoint 0
#define USB_O_FIFO1       0x00000024 // USB FIFO Endpoint 1
#define USB_O_FIFO2       0x00000028 // USB FIFO Endpoint 2
#define USB_O_FIFO3       0x0000002C // USB FIFO Endpoint 3
#define USB_O_FIFO4       0x00000030 // USB FIFO Endpoint 4
#define USB_O_FIFO5       0x00000034 // USB FIFO Endpoint 5
#define USB_O_FIFO6       0x00000038 // USB FIFO Endpoint 6
#define USB_O_FIFO7       0x0000003C // USB FIFO Endpoint 7
#define USB_O_DEVCTL      0x00000060 // USB Device Control
#define USB_O_CCONF       0x00000061 // USB Common Configuration
#define USB_O_TXFIFOSZ    0x00000062 // USB Transmit Dynamic FIFO Sizing
#define USB_O_RXFIFOSZ    0x00000063 // USB Receive Dynamic FIFO Sizing
#define USB_O_TXFIFOADD   0x00000064 // USB Transmit FIFO Start Address
#define USB_O_RXFIFOADD   0x00000066 // USB Receive FIFO Start Address
#define USB_O_ULPIVBUSCTL 0x00000070 // USB ULPI VBUS Control
#define USB_O_ULPIREGDATA 0x00000074 // USB ULPI Register Data
#define USB_O_ULPIREGADDR 0x00000075 // USB ULPI Register Address
#define USB_O_ULPIREGCTL  0x00000076 // USB ULPI Register Control
#define USB_O_EPINFO      0x00000078 // USB Endpoint Information
#define USB_O_RAMINFO     0x00000079 // USB RAM Information
#define USB_O_CONTIM      0x0000007A // USB Connect Timing
#define USB_O_VPLEN       0x0000007B // USB OTG VBUS Pulse Timing
#define USB_O_HSEOF \
    0x0000007C                       // USB High-Speed Last Transaction
                                     // to End of Frame Timing
#define USB_O_FSEOF \
    0x0000007D                       // USB Full-Speed Last Transaction
                                     // to End of Frame Timing
#define USB_O_LSEOF \
    0x0000007E                       // USB Low-Speed Last Transaction
                                     // to End of Frame Timing
#define USB_O_TXFUNCADDR0 \
    0x00000080                       // USB Transmit Functional Address
                                     // Endpoint 0
#define USB_O_TXHUBADDR0 \
    0x00000082                       // USB Transmit Hub Address
                                     // Endpoint 0
#define USB_O_TXHUBPORT0 0x00000083  // USB Transmit Hub Port Endpoint 0
#define USB_O_TXFUNCADDR1 \
    0x00000088                       // USB Transmit Functional Address
                                     // Endpoint 1
#define USB_O_TXHUBADDR1 \
    0x0000008A                       // USB Transmit Hub Address
                                     // Endpoint 1
#define USB_O_TXHUBPORT1 0x0000008B  // USB Transmit Hub Port Endpoint 1
#define USB_O_RXFUNCADDR1 \
    0x0000008C                       // USB Receive Functional Address
                                     // Endpoint 1
#define USB_O_RXHUBADDR1 \
    0x0000008E                       // USB Receive Hub Address Endpoint
                                     // 1
#define USB_O_RXHUBPORT1 0x0000008F  // USB Receive Hub Port Endpoint 1
#define USB_O_TXFUNCADDR2 \
    0x00000090                       // USB Transmit Functional Address
                                     // Endpoint 2
#define USB_O_TXHUBADDR2 \
    0x00000092                       // USB Transmit Hub Address
                                     // Endpoint 2
#define USB_O_TXHUBPORT2 0x00000093  // USB Transmit Hub Port Endpoint 2
#define USB_O_RXFUNCADDR2 \
    0x00000094                       // USB Receive Functional Address
                                     // Endpoint 2
#define USB_O_RXHUBADDR2 \
    0x00000096                       // USB Receive Hub Address Endpoint
                                     // 2
#define USB_O_RXHUBPORT2 0x00000097  // USB Receive Hub Port Endpoint 2
#define USB_O_TXFUNCADDR3 \
    0x00000098                       // USB Transmit Functional Address
                                     // Endpoint 3
#define USB_O_TXHUBADDR3 \
    0x0000009A                       // USB Transmit Hub Address
                                     // Endpoint 3
#define USB_O_TXHUBPORT3 0x0000009B  // USB Transmit Hub Port Endpoint 3
#define USB_O_RXFUNCADDR3 \
    0x0000009C                       // USB Receive Functional Address
                                     // Endpoint 3
#define USB_O_RXHUBADDR3 \
    0x0000009E                       // USB Receive Hub Address Endpoint
                                     // 3
#define USB_O_RXHUBPORT3 0x0000009F  // USB Receive Hub Port Endpoint 3
#define USB_O_TXFUNCADDR4 \
    0x000000A0                       // USB Transmit Functional Address
                                     // Endpoint 4
#define USB_O_TXHUBADDR4 \
    0x000000A2                       // USB Transmit Hub Address
                                     // Endpoint 4
#define USB_O_TXHUBPORT4 0x000000A3  // USB Transmit Hub Port Endpoint 4
#define USB_O_RXFUNCADDR4 \
    0x000000A4                       // USB Receive Functional Address
                                     // Endpoint 4
#define USB_O_RXHUBADDR4 \
    0x000000A6                       // USB Receive Hub Address Endpoint
                                     // 4
#define USB_O_RXHUBPORT4 0x000000A7  // USB Receive Hub Port Endpoint 4
#define USB_O_TXFUNCADDR5 \
    0x000000A8                       // USB Transmit Functional Address
                                     // Endpoint 5
#define USB_O_TXHUBADDR5 \
    0x000000AA                       // USB Transmit Hub Address
                                     // Endpoint 5
#define USB_O_TXHUBPORT5 0x000000AB  // USB Transmit Hub Port Endpoint 5
#define USB_O_RXFUNCADDR5 \
    0x000000AC                       // USB Receive Functional Address
                                     // Endpoint 5
#define USB_O_RXHUBADDR5 \
    0x000000AE                       // USB Receive Hub Address Endpoint
                                     // 5
#define USB_O_RXHUBPORT5 0x000000AF  // USB Receive Hub Port Endpoint 5
#define USB_O_TXFUNCADDR6 \
    0x000000B0                       // USB Transmit Functional Address
                                     // Endpoint 6
#define USB_O_TXHUBADDR6 \
    0x000000B2                       // USB Transmit Hub Address
                                     // Endpoint 6
#define USB_O_TXHUBPORT6 0x000000B3  // USB Transmit Hub Port Endpoint 6
#define USB_O_RXFUNCADDR6 \
    0x000000B4                       // USB Receive Functional Address
                                     // Endpoint 6
#define USB_O_RXHUBADDR6 \
    0x000000B6                       // USB Receive Hub Address Endpoint
                                     // 6
#define USB_O_RXHUBPORT6 0x000000B7  // USB Receive Hub Port Endpoint 6
#define USB_O_TXFUNCADDR7 \
    0x000000B8                       // USB Transmit Functional Address
                                     // Endpoint 7
#define USB_O_TXHUBADDR7 \
    0x000000BA                       // USB Transmit Hub Address
                                     // Endpoint 7
#define USB_O_TXHUBPORT7 0x000000BB  // USB Transmit Hub Port Endpoint 7
#define USB_O_RXFUNCADDR7 \
    0x000000BC                       // USB Receive Functional Address
                                     // Endpoint 7
#define USB_O_RXHUBADDR7 \
    0x000000BE                       // USB Receive Hub Address Endpoint
                                     // 7
#define USB_O_RXHUBPORT7 0x000000BF  // USB Receive Hub Port Endpoint 7
#define USB_O_CSRL0 \
    0x00000102                       // USB Control and Status Endpoint
                                     // 0 Low
#define USB_O_CSRH0 \
    0x00000103                       // USB Control and Status Endpoint
                                     // 0 High
#define USB_O_COUNT0 \
    0x00000108                       // USB Receive Byte Count Endpoint
                                     // 0
#define USB_O_TYPE0  0x0000010A      // USB Type Endpoint 0
#define USB_O_NAKLMT 0x0000010B      // USB NAK Limit
#define USB_O_TXMAXP1 \
    0x00000110                       // USB Maximum Transmit Data
                                     // Endpoint 1
#define USB_O_TXCSRL1 \
    0x00000112                       // USB Transmit Control and Status
                                     // Endpoint 1 Low
#define USB_O_TXCSRH1 \
    0x00000113                       // USB Transmit Control and Status
                                     // Endpoint 1 High
#define USB_O_RXMAXP1 \
    0x00000114                       // USB Maximum Receive Data
                                     // Endpoint 1
#define USB_O_RXCSRL1 \
    0x00000116                       // USB Receive Control and Status
                                     // Endpoint 1 Low
#define USB_O_RXCSRH1 \
    0x00000117                       // USB Receive Control and Status
                                     // Endpoint 1 High
#define USB_O_RXCOUNT1 \
    0x00000118                       // USB Receive Byte Count Endpoint
                                     // 1
#define USB_O_TXTYPE1 \
    0x0000011A                       // USB Host Transmit Configure Type
                                     // Endpoint 1
#define USB_O_TXINTERVAL1 \
    0x0000011B                       // USB Host Transmit Interval
                                     // Endpoint 1
#define USB_O_RXTYPE1 \
    0x0000011C                       // USB Host Configure Receive Type
                                     // Endpoint 1
#define USB_O_RXINTERVAL1 \
    0x0000011D                       // USB Host Receive Polling
                                     // Interval Endpoint 1
#define USB_O_TXMAXP2 \
    0x00000120                       // USB Maximum Transmit Data
                                     // Endpoint 2
#define USB_O_TXCSRL2 \
    0x00000122                       // USB Transmit Control and Status
                                     // Endpoint 2 Low
#define USB_O_TXCSRH2 \
    0x00000123                       // USB Transmit Control and Status
                                     // Endpoint 2 High
#define USB_O_RXMAXP2 \
    0x00000124                       // USB Maximum Receive Data
                                     // Endpoint 2
#define USB_O_RXCSRL2 \
    0x00000126                       // USB Receive Control and Status
                                     // Endpoint 2 Low
#define USB_O_RXCSRH2 \
    0x00000127                       // USB Receive Control and Status
                                     // Endpoint 2 High
#define USB_O_RXCOUNT2 \
    0x00000128                       // USB Receive Byte Count Endpoint
                                     // 2
#define USB_O_TXTYPE2 \
    0x0000012A                       // USB Host Transmit Configure Type
                                     // Endpoint 2
#define USB_O_TXINTERVAL2 \
    0x0000012B                       // USB Host Transmit Interval
                                     // Endpoint 2
#define USB_O_RXTYPE2 \
    0x0000012C                       // USB Host Configure Receive Type
                                     // Endpoint 2
#define USB_O_RXINTERVAL2 \
    0x0000012D                       // USB Host Receive Polling
                                     // Interval Endpoint 2
#define USB_O_TXMAXP3 \
    0x00000130                       // USB Maximum Transmit Data
                                     // Endpoint 3
#define USB_O_TXCSRL3 \
    0x00000132                       // USB Transmit Control and Status
                                     // Endpoint 3 Low
#define USB_O_TXCSRH3 \
    0x00000133                       // USB Transmit Control and Status
                                     // Endpoint 3 High
#define USB_O_RXMAXP3 \
    0x00000134                       // USB Maximum Receive Data
                                     // Endpoint 3
#define USB_O_RXCSRL3 \
    0x00000136                       // USB Receive Control and Status
                                     // Endpoint 3 Low
#define USB_O_RXCSRH3 \
    0x00000137                       // USB Receive Control and Status
                                     // Endpoint 3 High
#define USB_O_RXCOUNT3 \
    0x00000138                       // USB Receive Byte Count Endpoint
                                     // 3
#define USB_O_TXTYPE3 \
    0x0000013A                       // USB Host Transmit Configure Type
                                     // Endpoint 3
#define USB_O_TXINTERVAL3 \
    0x0000013B                       // USB Host Transmit Interval
                                     // Endpoint 3
#define USB_O_RXTYPE3 \
    0x0000013C                       // USB Host Configure Receive Type
                                     // Endpoint 3
#define USB_O_RXINTERVAL3 \
    0x0000013D                       // USB Host Receive Polling
                                     // Interval Endpoint 3
#define USB_O_TXMAXP4 \
    0x00000140                       // USB Maximum Transmit Data
                                     // Endpoint 4
#define USB_O_TXCSRL4 \
    0x00000142                       // USB Transmit Control and Status
                                     // Endpoint 4 Low
#define USB_O_TXCSRH4 \
    0x00000143                       // USB Transmit Control and Status
                                     // Endpoint 4 High
#define USB_O_RXMAXP4 \
    0x00000144                       // USB Maximum Receive Data
                                     // Endpoint 4
#define USB_O_RXCSRL4 \
    0x00000146                       // USB Receive Control and Status
                                     // Endpoint 4 Low
#define USB_O_RXCSRH4 \
    0x00000147                       // USB Receive Control and Status
                                     // Endpoint 4 High
#define USB_O_RXCOUNT4 \
    0x00000148                       // USB Receive Byte Count Endpoint
                                     // 4
#define USB_O_TXTYPE4 \
    0x0000014A                       // USB Host Transmit Configure Type
                                     // Endpoint 4
#define USB_O_TXINTERVAL4 \
    0x0000014B                       // USB Host Transmit Interval
                                     // Endpoint 4
#define USB_O_RXTYPE4 \
    0x0000014C                       // USB Host Configure Receive Type
                                     // Endpoint 4
#define USB_O_RXINTERVAL4 \
    0x0000014D                       // USB Host Receive Polling
                                     // Interval Endpoint 4
#define USB_O_TXMAXP5 \
    0x00000150                       // USB Maximum Transmit Data
                                     // Endpoint 5
#define USB_O_TXCSRL5 \
    0x00000152                       // USB Transmit Control and Status
                                     // Endpoint 5 Low
#define USB_O_TXCSRH5 \
    0x00000153                       // USB Transmit Control and Status
                                     // Endpoint 5 High
#define USB_O_RXMAXP5 \
    0x00000154                       // USB Maximum Receive Data
                                     // Endpoint 5
#define USB_O_RXCSRL5 \
    0x00000156                       // USB Receive Control and Status
                                     // Endpoint 5 Low
#define USB_O_RXCSRH5 \
    0x00000157                       // USB Receive Control and Status
                                     // Endpoint 5 High
#define USB_O_RXCOUNT5 \
    0x00000158                       // USB Receive Byte Count Endpoint
                                     // 5
#define USB_O_TXTYPE5 \
    0x0000015A                       // USB Host Transmit Configure Type
                                     // Endpoint 5
#define USB_O_TXINTERVAL5 \
    0x0000015B                       // USB Host Transmit Interval
                                     // Endpoint 5
#define USB_O_RXTYPE5 \
    0x0000015C                       // USB Host Configure Receive Type
                                     // Endpoint 5
#define USB_O_RXINTERVAL5 \
    0x0000015D                       // USB Host Receive Polling
                                     // Interval Endpoint 5
#define USB_O_TXMAXP6 \
    0x00000160                       // USB Maximum Transmit Data
                                     // Endpoint 6
#define USB_O_TXCSRL6 \
    0x00000162                       // USB Transmit Control and Status
                                     // Endpoint 6 Low
#define USB_O_TXCSRH6 \
    0x00000163                       // USB Transmit Control and Status
                                     // Endpoint 6 High
#define USB_O_RXMAXP6 \
    0x00000164                       // USB Maximum Receive Data
                                     // Endpoint 6
#define USB_O_RXCSRL6 \
    0x00000166                       // USB Receive Control and Status
                                     // Endpoint 6 Low
#define USB_O_RXCSRH6 \
    0x00000167                       // USB Receive Control and Status
                                     // Endpoint 6 High
#define USB_O_RXCOUNT6 \
    0x00000168                       // USB Receive Byte Count Endpoint
                                     // 6
#define USB_O_TXTYPE6 \
    0x0000016A                       // USB Host Transmit Configure Type
                                     // Endpoint 6
#define USB_O_TXINTERVAL6 \
    0x0000016B                       // USB Host Transmit Interval
                                     // Endpoint 6
#define USB_O_RXTYPE6 \
    0x0000016C                       // USB Host Configure Receive Type
                                     // Endpoint 6
#define USB_O_RXINTERVAL6 \
    0x0000016D                       // USB Host Receive Polling
                                     // Interval Endpoint 6
#define USB_O_TXMAXP7 \
    0x00000170                       // USB Maximum Transmit Data
                                     // Endpoint 7
#define USB_O_TXCSRL7 \
    0x00000172                       // USB Transmit Control and Status
                                     // Endpoint 7 Low
#define USB_O_TXCSRH7 \
    0x00000173                       // USB Transmit Control and Status
                                     // Endpoint 7 High
#define USB_O_RXMAXP7 \
    0x00000174                       // USB Maximum Receive Data
                                     // Endpoint 7
#define USB_O_RXCSRL7 \
    0x00000176                       // USB Receive Control and Status
                                     // Endpoint 7 Low
#define USB_O_RXCSRH7 \
    0x00000177                       // USB Receive Control and Status
                                     // Endpoint 7 High
#define USB_O_RXCOUNT7 \
    0x00000178                       // USB Receive Byte Count Endpoint
                                     // 7
#define USB_O_TXTYPE7 \
    0x0000017A                       // USB Host Transmit Configure Type
                                     // Endpoint 7
#define USB_O_TXINTERVAL7 \
    0x0000017B                       // USB Host Transmit Interval
                                     // Endpoint 7
#define USB_O_RXTYPE7 \
    0x0000017C                       // USB Host Configure Receive Type
                                     // Endpoint 7
#define USB_O_RXINTERVAL7 \
    0x0000017D                       // USB Host Receive Polling
                                     // Interval Endpoint 7
#define USB_O_DMAINTR   0x00000200   // USB DMA Interrupt
#define USB_O_DMACTL0   0x00000204   // USB DMA Control 0
#define USB_O_DMAADDR0  0x00000208   // USB DMA Address 0
#define USB_O_DMACOUNT0 0x0000020C   // USB DMA Count 0
#define USB_O_DMACTL1   0x00000214   // USB DMA Control 1
#define USB_O_DMAADDR1  0x00000218   // USB DMA Address 1
#define USB_O_DMACOUNT1 0x0000021C   // USB DMA Count 1
#define USB_O_DMACTL2   0x00000224   // USB DMA Control 2
#define USB_O_DMAADDR2  0x00000228   // USB DMA Address 2
#define USB_O_DMACOUNT2 0x0000022C   // USB DMA Count 2
#define USB_O_DMACTL3   0x00000234   // USB DMA Control 3
#define USB_O_DMAADDR3  0x00000238   // USB DMA Address 3
#define USB_O_DMACOUNT3 0x0000023C   // USB DMA Count 3
#define USB_O_DMACTL4   0x00000244   // USB DMA Control 4
#define USB_O_DMAADDR4  0x00000248   // USB DMA Address 4
#define USB_O_DMACOUNT4 0x0000024C   // USB DMA Count 4
#define USB_O_DMACTL5   0x00000254   // USB DMA Control 5
#define USB_O_DMAADDR5  0x00000258   // USB DMA Address 5
#define USB_O_DMACOUNT5 0x0000025C   // USB DMA Count 5
#define USB_O_DMACTL6   0x00000264   // USB DMA Control 6
#define USB_O_DMAADDR6  0x00000268   // USB DMA Address 6
#define USB_O_DMACOUNT6 0x0000026C   // USB DMA Count 6
#define USB_O_DMACTL7   0x00000274   // USB DMA Control 7
#define USB_O_DMAADDR7  0x00000278   // USB DMA Address 7
#define USB_O_DMACOUNT7 0x0000027C   // USB DMA Count 7
#define USB_O_RQPKTCOUNT1 \
    0x00000304                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 1
#define USB_O_RQPKTCOUNT2 \
    0x00000308                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 2
#define USB_O_RQPKTCOUNT3 \
