fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
    0x0000030C                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 3
#define USB_O_RQPKTCOUNT4 \
    0x00000310                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 4
#define USB_O_RQPKTCOUNT5 \
    0x00000314                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 5
#define USB_O_RQPKTCOUNT6 \
    0x00000318                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 6
#define USB_O_RQPKTCOUNT7 \
    0x0000031C                       // USB Request Packet Count in
                                     // Block Transfer Endpoint 7
#define USB_O_RXDPKTBUFDIS \
    0x00000340                       // USB Receive Double Packet Buffer
                                     // Disable
#define USB_O_TXDPKTBUFDIS \
    0x00000342                       // USB Transmit Double Packet
                                     // Buffer Disable
#define USB_O_CTO 0x00000344         // USB Chirp Timeout
#define USB_O_HHSRTN \
    0x00000346                       // USB High Speed to UTM Operating
                                     // Delay
#define USB_O_HSBT     0x00000348    // USB High Speed Time-out Adder
#define USB_O_LPMATTR  0x00000360    // USB LPM Attributes
#define USB_O_LPMCNTRL 0x00000362    // USB LPM Control
#define USB_O_LPMIM    0x00000363    // USB LPM Interrupt Mask
#define USB_O_LPMRIS   0x00000364    // USB LPM Raw Interrupt Status
#define USB_O_LPMFADDR 0x00000365    // USB LPM Function Address
#define USB_O_EPC      0x00000400    // USB External Power Control
#define USB_O_EPCRIS \
    0x00000404                       // USB External Power Control Raw
                                     // Interrupt Status
#define USB_O_EPCIM \
    0x00000408                       // USB External Power Control
                                     // Interrupt Mask
#define USB_O_EPCISC \
    0x0000040C                       // USB External Power Control
                                     // Interrupt Status and Clear
#define USB_O_DRRIS \
    0x00000410                       // USB Device RESUME Raw Interrupt
                                     // Status
#define USB_O_DRIM 0x00000414        // USB Device RESUME Interrupt Mask
#define USB_O_DRISC \
    0x00000418                       // USB Device RESUME Interrupt
                                     // Status and Clear
#define USB_O_GPCS \
    0x0000041C                       // USB General-Purpose Control and
                                     // Status
#define USB_O_VDC 0x00000430         // USB VBUS Droop Control
#define USB_O_VDCRIS \
    0x00000434                       // USB VBUS Droop Control Raw
                                     // Interrupt Status
#define USB_O_VDCIM \
    0x00000438                       // USB VBUS Droop Control Interrupt
                                     // Mask
#define USB_O_VDCISC \
    0x0000043C                       // USB VBUS Droop Control Interrupt
                                     // Status and Clear
#define USB_O_IDVRIS \
    0x00000444                       // USB ID Valid Detect Raw
                                     // Interrupt Status
#define USB_O_IDVIM \
    0x00000448                       // USB ID Valid Detect Interrupt
                                     // Mask
#define USB_O_IDVISC \
    0x0000044C                       // USB ID Valid Detect Interrupt
                                     // Status and Clear
#define USB_O_DMASEL 0x00000450      // USB DMA Select
#define USB_O_PP     0x00000FC0      // USB Peripheral Properties
#define USB_O_PC     0x00000FC4      // USB Peripheral Configuration
#define USB_O_CC     0x00000FC8      // USB Clock Configuration

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FADDR register.
//
//*****************************************************************************
#define USB_FADDR_M 0x0000007F // Function Address
#define USB_FADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_POWER register.
//
//*****************************************************************************
#define USB_POWER_ISOUP    0x00000080 // Isochronous Update
#define USB_POWER_SOFTCONN 0x00000040 // Soft Connect/Disconnect
#define USB_POWER_HSENAB   0x00000020 // High Speed Enable
#define USB_POWER_HSMODE   0x00000010 // High Speed Enable
#define USB_POWER_RESET    0x00000008 // RESET Signaling
#define USB_POWER_RESUME   0x00000004 // RESUME Signaling
#define USB_POWER_SUSPEND  0x00000002 // SUSPEND Mode
#define USB_POWER_PWRDNPHY 0x00000001 // Power Down PHY

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXIS register.
//
//*****************************************************************************
#define USB_TXIS_EP7 0x00000080 // TX Endpoint 7 Interrupt
#define USB_TXIS_EP6 0x00000040 // TX Endpoint 6 Interrupt
#define USB_TXIS_EP5 0x00000020 // TX Endpoint 5 Interrupt
#define USB_TXIS_EP4 0x00000010 // TX Endpoint 4 Interrupt
#define USB_TXIS_EP3 0x00000008 // TX Endpoint 3 Interrupt
#define USB_TXIS_EP2 0x00000004 // TX Endpoint 2 Interrupt
#define USB_TXIS_EP1 0x00000002 // TX Endpoint 1 Interrupt
#define USB_TXIS_EP0 0x00000001 // TX and RX Endpoint 0 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXIS register.
//
//*****************************************************************************
#define USB_RXIS_EP7 0x00000080 // RX Endpoint 7 Interrupt
#define USB_RXIS_EP6 0x00000040 // RX Endpoint 6 Interrupt
#define USB_RXIS_EP5 0x00000020 // RX Endpoint 5 Interrupt
#define USB_RXIS_EP4 0x00000010 // RX Endpoint 4 Interrupt
#define USB_RXIS_EP3 0x00000008 // RX Endpoint 3 Interrupt
#define USB_RXIS_EP2 0x00000004 // RX Endpoint 2 Interrupt
#define USB_RXIS_EP1 0x00000002 // RX Endpoint 1 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXIE register.
//
//*****************************************************************************
#define USB_TXIE_EP7 0x00000080 // TX Endpoint 7 Interrupt Enable
#define USB_TXIE_EP6 0x00000040 // TX Endpoint 6 Interrupt Enable
#define USB_TXIE_EP5 0x00000020 // TX Endpoint 5 Interrupt Enable
#define USB_TXIE_EP4 0x00000010 // TX Endpoint 4 Interrupt Enable
#define USB_TXIE_EP3 0x00000008 // TX Endpoint 3 Interrupt Enable
#define USB_TXIE_EP2 0x00000004 // TX Endpoint 2 Interrupt Enable
#define USB_TXIE_EP1 0x00000002 // TX Endpoint 1 Interrupt Enable
#define USB_TXIE_EP0 \
    0x00000001                  // TX and RX Endpoint 0 Interrupt
                                // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXIE register.
//
//*****************************************************************************
#define USB_RXIE_EP7 0x00000080 // RX Endpoint 7 Interrupt Enable
#define USB_RXIE_EP6 0x00000040 // RX Endpoint 6 Interrupt Enable
#define USB_RXIE_EP5 0x00000020 // RX Endpoint 5 Interrupt Enable
#define USB_RXIE_EP4 0x00000010 // RX Endpoint 4 Interrupt Enable
#define USB_RXIE_EP3 0x00000008 // RX Endpoint 3 Interrupt Enable
#define USB_RXIE_EP2 0x00000004 // RX Endpoint 2 Interrupt Enable
#define USB_RXIE_EP1 0x00000002 // RX Endpoint 1 Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IS register.
//
//*****************************************************************************
#define USB_IS_VBUSERR 0x00000080 // VBUS Error (OTG only)
#define USB_IS_SESREQ  0x00000040 // SESSION REQUEST (OTG only)
#define USB_IS_DISCON  0x00000020 // Session Disconnect (OTG only)
#define USB_IS_CONN    0x00000010 // Session Connect
#define USB_IS_SOF     0x00000008 // Start of Frame
#define USB_IS_BABBLE  0x00000004 // Babble Detected
#define USB_IS_RESET   0x00000004 // RESET Signaling Detected
#define USB_IS_RESUME  0x00000002 // RESUME Signaling Detected
#define USB_IS_SUSPEND 0x00000001 // SUSPEND Signaling Detected

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IE register.
//
//*****************************************************************************
#define USB_IE_VBUSERR \
    0x00000080                   // Enable VBUS Error Interrupt (OTG
                                 // only)
#define USB_IE_SESREQ \
    0x00000040                   // Enable Session Request (OTG
                                 // only)
#define USB_IE_DISCON 0x00000020 // Enable Disconnect Interrupt
#define USB_IE_CONN   0x00000010 // Enable Connect Interrupt
#define USB_IE_SOF    0x00000008 // Enable Start-of-Frame Interrupt
#define USB_IE_BABBLE 0x00000004 // Enable Babble Interrupt
#define USB_IE_RESET  0x00000004 // Enable RESET Interrupt
#define USB_IE_RESUME 0x00000002 // Enable RESUME Interrupt
#define USB_IE_SUSPND 0x00000001 // Enable SUSPEND Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FRAME register.
//
//*****************************************************************************
#define USB_FRAME_M 0x000007FF // Frame Number
#define USB_FRAME_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPIDX register.
//
//*****************************************************************************
#define USB_EPIDX_EPIDX_M 0x0000000F // Endpoint Index
#define USB_EPIDX_EPIDX_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TEST register.
//
//*****************************************************************************
#define USB_TEST_FORCEH     0x00000080 // Force Host Mode
#define USB_TEST_FIFOACC    0x00000040 // FIFO Access
#define USB_TEST_FORCEFS    0x00000020 // Force Full-Speed Mode
#define USB_TEST_FORCEHS    0x00000010 // Force High-Speed Mode
#define USB_TEST_TESTPKT    0x00000008 // Test Packet Mode Enable
#define USB_TEST_TESTK      0x00000004 // Test_K Mode Enable
#define USB_TEST_TESTJ      0x00000002 // Test_J Mode Enable
#define USB_TEST_TESTSE0NAK 0x00000001 // Test_SE0_NAK Test Mode Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO0 register.
//
//*****************************************************************************
#define USB_FIFO0_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO0_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO1 register.
//
//*****************************************************************************
#define USB_FIFO1_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO1_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO2 register.
//
//*****************************************************************************
#define USB_FIFO2_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO2_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO3 register.
//
//*****************************************************************************
#define USB_FIFO3_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO3_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO4 register.
//
//*****************************************************************************
#define USB_FIFO4_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO4_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO5 register.
//
//*****************************************************************************
#define USB_FIFO5_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO5_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO6 register.
//
//*****************************************************************************
#define USB_FIFO6_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO6_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO7 register.
//
//*****************************************************************************
#define USB_FIFO7_EPDATA_M 0xFFFFFFFF // Endpoint Data
#define USB_FIFO7_EPDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DEVCTL register.
//
//*****************************************************************************
#define USB_DEVCTL_DEV         0x00000080 // Device Mode (OTG only)
#define USB_DEVCTL_FSDEV       0x00000040 // Full-Speed Device Detected
#define USB_DEVCTL_LSDEV       0x00000020 // Low-Speed Device Detected
#define USB_DEVCTL_VBUS_M      0x00000018 // VBUS Level (OTG only)
#define USB_DEVCTL_VBUS_NONE   0x00000000 // Below SessionEnd
#define USB_DEVCTL_VBUS_SEND   0x00000008 // Above SessionEnd, below AValid
#define USB_DEVCTL_VBUS_AVALID 0x00000010 // Above AValid, below VBUSValid
#define USB_DEVCTL_VBUS_VALID  0x00000018 // Above VBUSValid
#define USB_DEVCTL_HOST        0x00000004 // Host Mode
#define USB_DEVCTL_HOSTREQ     0x00000002 // Host Request (OTG only)
#define USB_DEVCTL_SESSION     0x00000001 // Session Start/End (OTG only)

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CCONF register.
//
//*****************************************************************************
#define USB_CCONF_TXEDMA 0x00000002 // TX Early DMA Enable
#define USB_CCONF_RXEDMA 0x00000001 // TX Early DMA Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFIFOSZ register.
//
//*****************************************************************************
#define USB_TXFIFOSZ_DPB       0x00000010 // Double Packet Buffer Support
#define USB_TXFIFOSZ_SIZE_M    0x0000000F // Max Packet Size
#define USB_TXFIFOSZ_SIZE_8    0x00000000 // 8
#define USB_TXFIFOSZ_SIZE_16   0x00000001 // 16
#define USB_TXFIFOSZ_SIZE_32   0x00000002 // 32
#define USB_TXFIFOSZ_SIZE_64   0x00000003 // 64
#define USB_TXFIFOSZ_SIZE_128  0x00000004 // 128
#define USB_TXFIFOSZ_SIZE_256  0x00000005 // 256
#define USB_TXFIFOSZ_SIZE_512  0x00000006 // 512
#define USB_TXFIFOSZ_SIZE_1024 0x00000007 // 1024
#define USB_TXFIFOSZ_SIZE_2048 0x00000008 // 2048

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFIFOSZ register.
//
//*****************************************************************************
#define USB_RXFIFOSZ_DPB       0x00000010 // Double Packet Buffer Support
#define USB_RXFIFOSZ_SIZE_M    0x0000000F // Max Packet Size
#define USB_RXFIFOSZ_SIZE_8    0x00000000 // 8
#define USB_RXFIFOSZ_SIZE_16   0x00000001 // 16
#define USB_RXFIFOSZ_SIZE_32   0x00000002 // 32
#define USB_RXFIFOSZ_SIZE_64   0x00000003 // 64
#define USB_RXFIFOSZ_SIZE_128  0x00000004 // 128
#define USB_RXFIFOSZ_SIZE_256  0x00000005 // 256
#define USB_RXFIFOSZ_SIZE_512  0x00000006 // 512
#define USB_RXFIFOSZ_SIZE_1024 0x00000007 // 1024
#define USB_RXFIFOSZ_SIZE_2048 0x00000008 // 2048

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFIFOADD
// register.
//
//*****************************************************************************
#define USB_TXFIFOADD_ADDR_M 0x000001FF // Transmit/Receive Start Address
#define USB_TXFIFOADD_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFIFOADD
// register.
//
//*****************************************************************************
#define USB_RXFIFOADD_ADDR_M 0x000001FF // Transmit/Receive Start Address
#define USB_RXFIFOADD_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_ULPIVBUSCTL
// register.
//
//*****************************************************************************
#define USB_ULPIVBUSCTL_USEEXTVBUSIND 0x00000002 // Use External VBUS Indicator
#define USB_ULPIVBUSCTL_USEEXTVBUS    0x00000001 // Use External VBUS

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_ULPIREGDATA
// register.
//
//*****************************************************************************
#define USB_ULPIREGDATA_REGDATA_M 0x000000FF // Register Data
#define USB_ULPIREGDATA_REGDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_ULPIREGADDR
// register.
//
//*****************************************************************************
#define USB_ULPIREGADDR_ADDR_M 0x000000FF // Register Address
#define USB_ULPIREGADDR_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_ULPIREGCTL
// register.
//
//*****************************************************************************
#define USB_ULPIREGCTL_RDWR     0x00000004 // Read/Write Control
#define USB_ULPIREGCTL_REGCMPLT 0x00000002 // Register Access Complete
#define USB_ULPIREGCTL_REGACC   0x00000001 // Initiate Register Access

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPINFO register.
//
//*****************************************************************************
#define USB_EPINFO_RXEP_M 0x000000F0 // RX Endpoints
#define USB_EPINFO_TXEP_M 0x0000000F // TX Endpoints
#define USB_EPINFO_RXEP_S 4
#define USB_EPINFO_TXEP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RAMINFO register.
//
//*****************************************************************************
#define USB_RAMINFO_DMACHAN_M 0x000000F0 // DMA Channels
#define USB_RAMINFO_RAMBITS_M 0x0000000F // RAM Address Bus Width
#define USB_RAMINFO_DMACHAN_S 4
#define USB_RAMINFO_RAMBITS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CONTIM register.
//
//*****************************************************************************
#define USB_CONTIM_WTCON_M 0x000000F0 // Connect Wait
#define USB_CONTIM_WTID_M  0x0000000F // Wait ID
#define USB_CONTIM_WTCON_S 4
#define USB_CONTIM_WTID_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VPLEN register.
//
//*****************************************************************************
#define USB_VPLEN_VPLEN_M 0x000000FF // VBUS Pulse Length
#define USB_VPLEN_VPLEN_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_HSEOF register.
//
//*****************************************************************************
#define USB_HSEOF_HSEOFG_M 0x000000FF // HIgh-Speed End-of-Frame Gap
#define USB_HSEOF_HSEOFG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FSEOF register.
//
//*****************************************************************************
#define USB_FSEOF_FSEOFG_M 0x000000FF // Full-Speed End-of-Frame Gap
#define USB_FSEOF_FSEOFG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LSEOF register.
//
//*****************************************************************************
#define USB_LSEOF_LSEOFG_M 0x000000FF // Low-Speed End-of-Frame Gap
#define USB_LSEOF_LSEOFG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR0
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR0_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR0_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR0
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR0_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR0_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT0
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT0_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT0_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR1
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR1_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR1_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR1
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR1_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR1_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT1
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT1_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT1_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR1
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR1_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR1_ADDR_S 0

