fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR1
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR1_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR1_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT1
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT1_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT1_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR2
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR2_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR2
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR2_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT2
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT2_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT2_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR2
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR2_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR2
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR2_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR2_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT2
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT2_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT2_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR3
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR3_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR3
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR3_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT3
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT3_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT3_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR3
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR3_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR3
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR3_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR3_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT3
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT3_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT3_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR4
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR4_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR4
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR4_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT4
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT4_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT4_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR4
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR4_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR4
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR4_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR4_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT4
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT4_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT4_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR5
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR5_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR5_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR5
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR5_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR5_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT5
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT5_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT5_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR5
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR5_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR5_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR5
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR5_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR5_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT5
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT5_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT5_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR6
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR6_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR6_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR6
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR6_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR6_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT6
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT6_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT6_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR6
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR6_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR6_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR6
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR6_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR6_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT6
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT6_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT6_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR7
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR7_ADDR_M 0x0000007F // Device Address
#define USB_TXFUNCADDR7_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR7
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR7_ADDR_M 0x0000007F // Hub Address
#define USB_TXHUBADDR7_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT7
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT7_PORT_M 0x0000007F // Hub Port
#define USB_TXHUBPORT7_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR7
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR7_ADDR_M 0x0000007F // Device Address
#define USB_RXFUNCADDR7_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR7
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR7_ADDR_M 0x0000007F // Hub Address
#define USB_RXHUBADDR7_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT7
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT7_PORT_M 0x0000007F // Hub Port
#define USB_RXHUBPORT7_PORT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CSRL0 register.
//
//*****************************************************************************
#define USB_CSRL0_NAKTO   0x00000080 // NAK Timeout
#define USB_CSRL0_SETENDC 0x00000080 // Setup End Clear
#define USB_CSRL0_STATUS  0x00000040 // STATUS Packet
#define USB_CSRL0_RXRDYC  0x00000040 // RXRDY Clear
#define USB_CSRL0_REQPKT  0x00000020 // Request Packet
#define USB_CSRL0_STALL   0x00000020 // Send Stall
#define USB_CSRL0_SETEND  0x00000010 // Setup End
#define USB_CSRL0_ERROR   0x00000010 // Error
#define USB_CSRL0_DATAEND 0x00000008 // Data End
#define USB_CSRL0_SETUP   0x00000008 // Setup Packet
#define USB_CSRL0_STALLED 0x00000004 // Endpoint Stalled
#define USB_CSRL0_TXRDY   0x00000002 // Transmit Packet Ready
#define USB_CSRL0_RXRDY   0x00000001 // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CSRH0 register.
//
//*****************************************************************************
#define USB_CSRH0_DISPING 0x00000008 // PING Disable
#define USB_CSRH0_DTWE    0x00000004 // Data Toggle Write Enable
#define USB_CSRH0_DT      0x00000002 // Data Toggle
#define USB_CSRH0_FLUSH   0x00000001 // Flush FIFO

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_COUNT0 register.
//
//*****************************************************************************
#define USB_COUNT0_COUNT_M 0x0000007F // FIFO Count
#define USB_COUNT0_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TYPE0 register.
//
//*****************************************************************************
#define USB_TYPE0_SPEED_M    0x000000C0 // Operating Speed
#define USB_TYPE0_SPEED_HIGH 0x00000040 // High
#define USB_TYPE0_SPEED_FULL 0x00000080 // Full
#define USB_TYPE0_SPEED_LOW  0x000000C0 // Low

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_NAKLMT register.
//
//*****************************************************************************
#define USB_NAKLMT_NAKLMT_M 0x0000001F // EP0 NAK Limit
#define USB_NAKLMT_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP1 register.
//
//*****************************************************************************
#define USB_TXMAXP1_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_TXMAXP1_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL1 register.
//
//*****************************************************************************
#define USB_TXCSRL1_NAKTO   0x00000080 // NAK Timeout
#define USB_TXCSRL1_CLRDT   0x00000040 // Clear Data Toggle
#define USB_TXCSRL1_STALLED 0x00000020 // Endpoint Stalled
#define USB_TXCSRL1_STALL   0x00000010 // Send STALL
#define USB_TXCSRL1_SETUP   0x00000010 // Setup Packet
#define USB_TXCSRL1_FLUSH   0x00000008 // Flush FIFO
#define USB_TXCSRL1_ERROR   0x00000004 // Error
#define USB_TXCSRL1_UNDRN   0x00000004 // Underrun
#define USB_TXCSRL1_FIFONE  0x00000002 // FIFO Not Empty
#define USB_TXCSRL1_TXRDY   0x00000001 // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH1 register.
//
//*****************************************************************************
#define USB_TXCSRH1_AUTOSET 0x00000080 // Auto Set
#define USB_TXCSRH1_ISO     0x00000040 // Isochronous Transfers
#define USB_TXCSRH1_MODE    0x00000020 // Mode
#define USB_TXCSRH1_DMAEN   0x00000010 // DMA Request Enable
#define USB_TXCSRH1_FDT     0x00000008 // Force Data Toggle
#define USB_TXCSRH1_DMAMOD  0x00000004 // DMA Request Mode
#define USB_TXCSRH1_DTWE    0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH1_DT      0x00000001 // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP1 register.
//
//*****************************************************************************
#define USB_RXMAXP1_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_RXMAXP1_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL1 register.
//
//*****************************************************************************
#define USB_RXCSRL1_CLRDT   0x00000080 // Clear Data Toggle
#define USB_RXCSRL1_STALLED 0x00000040 // Endpoint Stalled
#define USB_RXCSRL1_STALL   0x00000020 // Send STALL
#define USB_RXCSRL1_REQPKT  0x00000020 // Request Packet
#define USB_RXCSRL1_FLUSH   0x00000010 // Flush FIFO
#define USB_RXCSRL1_DATAERR 0x00000008 // Data Error
#define USB_RXCSRL1_NAKTO   0x00000008 // NAK Timeout
#define USB_RXCSRL1_OVER    0x00000004 // Overrun
#define USB_RXCSRL1_ERROR   0x00000004 // Error
#define USB_RXCSRL1_FULL    0x00000002 // FIFO Full
#define USB_RXCSRL1_RXRDY   0x00000001 // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH1 register.
//
//*****************************************************************************
#define USB_RXCSRH1_AUTOCL  0x00000080 // Auto Clear
#define USB_RXCSRH1_AUTORQ  0x00000040 // Auto Request
#define USB_RXCSRH1_ISO     0x00000040 // Isochronous Transfers
#define USB_RXCSRH1_DMAEN   0x00000020 // DMA Request Enable
#define USB_RXCSRH1_DISNYET 0x00000010 // Disable NYET
#define USB_RXCSRH1_PIDERR  0x00000010 // PID Error
#define USB_RXCSRH1_DMAMOD  0x00000008 // DMA Request Mode
#define USB_RXCSRH1_DTWE    0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH1_DT      0x00000002 // Data Toggle
#define USB_RXCSRH1_INCOMPRX \
    0x00000001                         // Incomplete RX Transmission
                                       // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT1 register.
//
//*****************************************************************************
#define USB_RXCOUNT1_COUNT_M 0x00001FFF // Receive Packet Count
#define USB_RXCOUNT1_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE1 register.
//
//*****************************************************************************
#define USB_TXTYPE1_SPEED_M    0x000000C0 // Operating Speed
#define USB_TXTYPE1_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE1_SPEED_HIGH 0x00000040 // High
#define USB_TXTYPE1_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE1_SPEED_LOW  0x000000C0 // Low
#define USB_TXTYPE1_PROTO_M    0x00000030 // Protocol
#define USB_TXTYPE1_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE1_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE1_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE1_PROTO_INT  0x00000030 // Interrupt
#define USB_TXTYPE1_TEP_M      0x0000000F // Target Endpoint Number
#define USB_TXTYPE1_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL1
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL1_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL1_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL1_TXPOLL_S 0
#define USB_TXINTERVAL1_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE1 register.
//
//*****************************************************************************
#define USB_RXTYPE1_SPEED_M    0x000000C0 // Operating Speed
#define USB_RXTYPE1_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE1_SPEED_HIGH 0x00000040 // High
#define USB_RXTYPE1_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE1_SPEED_LOW  0x000000C0 // Low
#define USB_RXTYPE1_PROTO_M    0x00000030 // Protocol
#define USB_RXTYPE1_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE1_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE1_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE1_PROTO_INT  0x00000030 // Interrupt
#define USB_RXTYPE1_TEP_M      0x0000000F // Target Endpoint Number
#define USB_RXTYPE1_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL1
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL1_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL1_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL1_TXPOLL_S 0
#define USB_RXINTERVAL1_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP2 register.
//
//*****************************************************************************
#define USB_TXMAXP2_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_TXMAXP2_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL2 register.
//
//*****************************************************************************
#define USB_TXCSRL2_NAKTO   0x00000080 // NAK Timeout
#define USB_TXCSRL2_CLRDT   0x00000040 // Clear Data Toggle
#define USB_TXCSRL2_STALLED 0x00000020 // Endpoint Stalled
#define USB_TXCSRL2_SETUP   0x00000010 // Setup Packet
#define USB_TXCSRL2_STALL   0x00000010 // Send STALL
#define USB_TXCSRL2_FLUSH   0x00000008 // Flush FIFO
#define USB_TXCSRL2_ERROR   0x00000004 // Error
#define USB_TXCSRL2_UNDRN   0x00000004 // Underrun
#define USB_TXCSRL2_FIFONE  0x00000002 // FIFO Not Empty
#define USB_TXCSRL2_TXRDY   0x00000001 // Transmit Packet Ready

