fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE5 register.
//
//*****************************************************************************
#define USB_TXTYPE5_SPEED_M    0x000000C0 // Operating Speed
#define USB_TXTYPE5_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE5_SPEED_HIGH 0x00000040 // High
#define USB_TXTYPE5_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE5_SPEED_LOW  0x000000C0 // Low
#define USB_TXTYPE5_PROTO_M    0x00000030 // Protocol
#define USB_TXTYPE5_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE5_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE5_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE5_PROTO_INT  0x00000030 // Interrupt
#define USB_TXTYPE5_TEP_M      0x0000000F // Target Endpoint Number
#define USB_TXTYPE5_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL5
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL5_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL5_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL5_NAKLMT_S 0
#define USB_TXINTERVAL5_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE5 register.
//
//*****************************************************************************
#define USB_RXTYPE5_SPEED_M    0x000000C0 // Operating Speed
#define USB_RXTYPE5_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE5_SPEED_HIGH 0x00000040 // High
#define USB_RXTYPE5_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE5_SPEED_LOW  0x000000C0 // Low
#define USB_RXTYPE5_PROTO_M    0x00000030 // Protocol
#define USB_RXTYPE5_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE5_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE5_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE5_PROTO_INT  0x00000030 // Interrupt
#define USB_RXTYPE5_TEP_M      0x0000000F // Target Endpoint Number
#define USB_RXTYPE5_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL5
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL5_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL5_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL5_TXPOLL_S 0
#define USB_RXINTERVAL5_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP6 register.
//
//*****************************************************************************
#define USB_TXMAXP6_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_TXMAXP6_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL6 register.
//
//*****************************************************************************
#define USB_TXCSRL6_NAKTO   0x00000080 // NAK Timeout
#define USB_TXCSRL6_CLRDT   0x00000040 // Clear Data Toggle
#define USB_TXCSRL6_STALLED 0x00000020 // Endpoint Stalled
#define USB_TXCSRL6_STALL   0x00000010 // Send STALL
#define USB_TXCSRL6_SETUP   0x00000010 // Setup Packet
#define USB_TXCSRL6_FLUSH   0x00000008 // Flush FIFO
#define USB_TXCSRL6_ERROR   0x00000004 // Error
#define USB_TXCSRL6_UNDRN   0x00000004 // Underrun
#define USB_TXCSRL6_FIFONE  0x00000002 // FIFO Not Empty
#define USB_TXCSRL6_TXRDY   0x00000001 // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH6 register.
//
//*****************************************************************************
#define USB_TXCSRH6_AUTOSET 0x00000080 // Auto Set
#define USB_TXCSRH6_ISO     0x00000040 // Isochronous Transfers
#define USB_TXCSRH6_MODE    0x00000020 // Mode
#define USB_TXCSRH6_DMAEN   0x00000010 // DMA Request Enable
#define USB_TXCSRH6_FDT     0x00000008 // Force Data Toggle
#define USB_TXCSRH6_DMAMOD  0x00000004 // DMA Request Mode
#define USB_TXCSRH6_DTWE    0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH6_DT      0x00000001 // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP6 register.
//
//*****************************************************************************
#define USB_RXMAXP6_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_RXMAXP6_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL6 register.
//
//*****************************************************************************
#define USB_RXCSRL6_CLRDT   0x00000080 // Clear Data Toggle
#define USB_RXCSRL6_STALLED 0x00000040 // Endpoint Stalled
#define USB_RXCSRL6_REQPKT  0x00000020 // Request Packet
#define USB_RXCSRL6_STALL   0x00000020 // Send STALL
#define USB_RXCSRL6_FLUSH   0x00000010 // Flush FIFO
#define USB_RXCSRL6_NAKTO   0x00000008 // NAK Timeout
#define USB_RXCSRL6_DATAERR 0x00000008 // Data Error
#define USB_RXCSRL6_ERROR   0x00000004 // Error
#define USB_RXCSRL6_OVER    0x00000004 // Overrun
#define USB_RXCSRL6_FULL    0x00000002 // FIFO Full
#define USB_RXCSRL6_RXRDY   0x00000001 // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH6 register.
//
//*****************************************************************************
#define USB_RXCSRH6_AUTOCL  0x00000080 // Auto Clear
#define USB_RXCSRH6_AUTORQ  0x00000040 // Auto Request
#define USB_RXCSRH6_ISO     0x00000040 // Isochronous Transfers
#define USB_RXCSRH6_DMAEN   0x00000020 // DMA Request Enable
#define USB_RXCSRH6_DISNYET 0x00000010 // Disable NYET
#define USB_RXCSRH6_PIDERR  0x00000010 // PID Error
#define USB_RXCSRH6_DMAMOD  0x00000008 // DMA Request Mode
#define USB_RXCSRH6_DTWE    0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH6_DT      0x00000002 // Data Toggle
#define USB_RXCSRH6_INCOMPRX \
    0x00000001                         // Incomplete RX Transmission
                                       // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT6 register.
//
//*****************************************************************************
#define USB_RXCOUNT6_COUNT_M 0x00001FFF // Receive Packet Count
#define USB_RXCOUNT6_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE6 register.
//
//*****************************************************************************
#define USB_TXTYPE6_SPEED_M    0x000000C0 // Operating Speed
#define USB_TXTYPE6_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE6_SPEED_HIGH 0x00000040 // High
#define USB_TXTYPE6_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE6_SPEED_LOW  0x000000C0 // Low
#define USB_TXTYPE6_PROTO_M    0x00000030 // Protocol
#define USB_TXTYPE6_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE6_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE6_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE6_PROTO_INT  0x00000030 // Interrupt
#define USB_TXTYPE6_TEP_M      0x0000000F // Target Endpoint Number
#define USB_TXTYPE6_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL6_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL6_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL6_TXPOLL_S 0
#define USB_TXINTERVAL6_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE6 register.
//
//*****************************************************************************
#define USB_RXTYPE6_SPEED_M    0x000000C0 // Operating Speed
#define USB_RXTYPE6_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE6_SPEED_HIGH 0x00000040 // High
#define USB_RXTYPE6_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE6_SPEED_LOW  0x000000C0 // Low
#define USB_RXTYPE6_PROTO_M    0x00000030 // Protocol
#define USB_RXTYPE6_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE6_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE6_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE6_PROTO_INT  0x00000030 // Interrupt
#define USB_RXTYPE6_TEP_M      0x0000000F // Target Endpoint Number
#define USB_RXTYPE6_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL6_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL6_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL6_NAKLMT_S 0
#define USB_RXINTERVAL6_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP7 register.
//
//*****************************************************************************
#define USB_TXMAXP7_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_TXMAXP7_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL7 register.
//
//*****************************************************************************
#define USB_TXCSRL7_NAKTO   0x00000080 // NAK Timeout
#define USB_TXCSRL7_CLRDT   0x00000040 // Clear Data Toggle
#define USB_TXCSRL7_STALLED 0x00000020 // Endpoint Stalled
#define USB_TXCSRL7_STALL   0x00000010 // Send STALL
#define USB_TXCSRL7_SETUP   0x00000010 // Setup Packet
#define USB_TXCSRL7_FLUSH   0x00000008 // Flush FIFO
#define USB_TXCSRL7_ERROR   0x00000004 // Error
#define USB_TXCSRL7_UNDRN   0x00000004 // Underrun
#define USB_TXCSRL7_FIFONE  0x00000002 // FIFO Not Empty
#define USB_TXCSRL7_TXRDY   0x00000001 // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH7 register.
//
//*****************************************************************************
#define USB_TXCSRH7_AUTOSET 0x00000080 // Auto Set
#define USB_TXCSRH7_ISO     0x00000040 // Isochronous Transfers
#define USB_TXCSRH7_MODE    0x00000020 // Mode
#define USB_TXCSRH7_DMAEN   0x00000010 // DMA Request Enable
#define USB_TXCSRH7_FDT     0x00000008 // Force Data Toggle
#define USB_TXCSRH7_DMAMOD  0x00000004 // DMA Request Mode
#define USB_TXCSRH7_DTWE    0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH7_DT      0x00000001 // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP7 register.
//
//*****************************************************************************
#define USB_RXMAXP7_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_RXMAXP7_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL7 register.
//
//*****************************************************************************
#define USB_RXCSRL7_CLRDT   0x00000080 // Clear Data Toggle
#define USB_RXCSRL7_STALLED 0x00000040 // Endpoint Stalled
#define USB_RXCSRL7_REQPKT  0x00000020 // Request Packet
#define USB_RXCSRL7_STALL   0x00000020 // Send STALL
#define USB_RXCSRL7_FLUSH   0x00000010 // Flush FIFO
#define USB_RXCSRL7_DATAERR 0x00000008 // Data Error
#define USB_RXCSRL7_NAKTO   0x00000008 // NAK Timeout
#define USB_RXCSRL7_ERROR   0x00000004 // Error
#define USB_RXCSRL7_OVER    0x00000004 // Overrun
#define USB_RXCSRL7_FULL    0x00000002 // FIFO Full
#define USB_RXCSRL7_RXRDY   0x00000001 // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH7 register.
//
//*****************************************************************************
#define USB_RXCSRH7_AUTOCL  0x00000080 // Auto Clear
#define USB_RXCSRH7_ISO     0x00000040 // Isochronous Transfers
#define USB_RXCSRH7_AUTORQ  0x00000040 // Auto Request
#define USB_RXCSRH7_DMAEN   0x00000020 // DMA Request Enable
#define USB_RXCSRH7_PIDERR  0x00000010 // PID Error
#define USB_RXCSRH7_DISNYET 0x00000010 // Disable NYET
#define USB_RXCSRH7_DMAMOD  0x00000008 // DMA Request Mode
#define USB_RXCSRH7_DTWE    0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH7_DT      0x00000002 // Data Toggle
#define USB_RXCSRH7_INCOMPRX \
    0x00000001                         // Incomplete RX Transmission
                                       // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT7 register.
//
//*****************************************************************************
#define USB_RXCOUNT7_COUNT_M 0x00001FFF // Receive Packet Count
#define USB_RXCOUNT7_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE7 register.
//
//*****************************************************************************
#define USB_TXTYPE7_SPEED_M    0x000000C0 // Operating Speed
#define USB_TXTYPE7_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE7_SPEED_HIGH 0x00000040 // High
#define USB_TXTYPE7_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE7_SPEED_LOW  0x000000C0 // Low
#define USB_TXTYPE7_PROTO_M    0x00000030 // Protocol
#define USB_TXTYPE7_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE7_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE7_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE7_PROTO_INT  0x00000030 // Interrupt
#define USB_TXTYPE7_TEP_M      0x0000000F // Target Endpoint Number
#define USB_TXTYPE7_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL7_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL7_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL7_NAKLMT_S 0
#define USB_TXINTERVAL7_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE7 register.
//
//*****************************************************************************
#define USB_RXTYPE7_SPEED_M    0x000000C0 // Operating Speed
#define USB_RXTYPE7_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE7_SPEED_HIGH 0x00000040 // High
#define USB_RXTYPE7_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE7_SPEED_LOW  0x000000C0 // Low
#define USB_RXTYPE7_PROTO_M    0x00000030 // Protocol
#define USB_RXTYPE7_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE7_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE7_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE7_PROTO_INT  0x00000030 // Interrupt
#define USB_RXTYPE7_TEP_M      0x0000000F // Target Endpoint Number
#define USB_RXTYPE7_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL7_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL7_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL7_NAKLMT_S 0
#define USB_RXINTERVAL7_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAINTR register.
//
//*****************************************************************************
#define USB_DMAINTR_CH7 0x00000080 // Channel 7 DMA Interrupt
#define USB_DMAINTR_CH6 0x00000040 // Channel 6 DMA Interrupt
#define USB_DMAINTR_CH5 0x00000020 // Channel 5 DMA Interrupt
#define USB_DMAINTR_CH4 0x00000010 // Channel 4 DMA Interrupt
#define USB_DMAINTR_CH3 0x00000008 // Channel 3 DMA Interrupt
#define USB_DMAINTR_CH2 0x00000004 // Channel 2 DMA Interrupt
#define USB_DMAINTR_CH1 0x00000002 // Channel 1 DMA Interrupt
#define USB_DMAINTR_CH0 0x00000001 // Channel 0 DMA Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL0 register.
//
//*****************************************************************************
#define USB_DMACTL0_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL0_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL0_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL0_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL0_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL0_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL0_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL0_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL0_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL0_DIR    0x00000002     // DMA Direction
#define USB_DMACTL0_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL0_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR0 register.
//
//*****************************************************************************
#define USB_DMAADDR0_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR0_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT0
// register.
//
//*****************************************************************************
#define USB_DMACOUNT0_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT0_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL1 register.
//
//*****************************************************************************
#define USB_DMACTL1_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL1_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL1_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL1_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL1_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL1_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL1_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL1_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL1_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL1_DIR    0x00000002     // DMA Direction
#define USB_DMACTL1_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL1_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR1 register.
//
//*****************************************************************************
#define USB_DMAADDR1_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR1_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT1
// register.
//
//*****************************************************************************
#define USB_DMACOUNT1_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT1_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL2 register.
//
//*****************************************************************************
#define USB_DMACTL2_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL2_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL2_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL2_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL2_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL2_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL2_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL2_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL2_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL2_DIR    0x00000002     // DMA Direction
#define USB_DMACTL2_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL2_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR2 register.
//
//*****************************************************************************
#define USB_DMAADDR2_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR2_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT2
// register.
//
//*****************************************************************************
#define USB_DMACOUNT2_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT2_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL3 register.
//
//*****************************************************************************
#define USB_DMACTL3_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL3_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL3_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL3_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL3_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL3_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL3_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL3_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL3_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL3_DIR    0x00000002     // DMA Direction
#define USB_DMACTL3_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL3_EP_S   4

