fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR3 register.
//
//*****************************************************************************
#define USB_DMAADDR3_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR3_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT3
// register.
//
//*****************************************************************************
#define USB_DMACOUNT3_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT3_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL4 register.
//
//*****************************************************************************
#define USB_DMACTL4_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL4_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL4_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL4_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL4_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL4_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL4_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL4_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL4_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL4_DIR    0x00000002     // DMA Direction
#define USB_DMACTL4_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL4_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR4 register.
//
//*****************************************************************************
#define USB_DMAADDR4_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR4_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT4
// register.
//
//*****************************************************************************
#define USB_DMACOUNT4_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT4_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL5 register.
//
//*****************************************************************************
#define USB_DMACTL5_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL5_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL5_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL5_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL5_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL5_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL5_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL5_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL5_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL5_DIR    0x00000002     // DMA Direction
#define USB_DMACTL5_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL5_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR5 register.
//
//*****************************************************************************
#define USB_DMAADDR5_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR5_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT5
// register.
//
//*****************************************************************************
#define USB_DMACOUNT5_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT5_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL6 register.
//
//*****************************************************************************
#define USB_DMACTL6_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL6_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL6_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL6_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL6_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL6_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL6_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL6_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL6_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL6_DIR    0x00000002     // DMA Direction
#define USB_DMACTL6_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL6_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR6 register.
//
//*****************************************************************************
#define USB_DMAADDR6_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR6_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT6
// register.
//
//*****************************************************************************
#define USB_DMACOUNT6_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT6_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACTL7 register.
//
//*****************************************************************************
#define USB_DMACTL7_BRSTM_M    0x00000600 // Burst Mode
#define USB_DMACTL7_BRSTM_ANY  0x00000000 // Bursts of unspecified length
#define USB_DMACTL7_BRSTM_INC4 0x00000200 // INCR4 or unspecified length
#define USB_DMACTL7_BRSTM_INC8 \
    0x00000400                            // INCR8, INCR4 or unspecified
                                          // length
#define USB_DMACTL7_BRSTM_INC16 \
    0x00000600                            // INCR16, INCR8, INCR4 or
                                          // unspecified length
#define USB_DMACTL7_ERR    0x00000100     // Bus Error Bit
#define USB_DMACTL7_EP_M   0x000000F0     // Endpoint number
#define USB_DMACTL7_IE     0x00000008     // DMA Interrupt Enable
#define USB_DMACTL7_MODE   0x00000004     // DMA Transfer Mode
#define USB_DMACTL7_DIR    0x00000002     // DMA Direction
#define USB_DMACTL7_ENABLE 0x00000001     // DMA Transfer Enable
#define USB_DMACTL7_EP_S   4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMAADDR7 register.
//
//*****************************************************************************
#define USB_DMAADDR7_ADDR_M 0xFFFFFFFC // DMA Address
#define USB_DMAADDR7_ADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMACOUNT7
// register.
//
//*****************************************************************************
#define USB_DMACOUNT7_COUNT_M 0xFFFFFFFC // DMA Count
#define USB_DMACOUNT7_COUNT_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT1
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT1_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT1_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT2
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT2_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT2_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT3
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT3_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT3_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT4
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT4_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT4_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT5
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT5_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT5_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT6
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT6_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT6_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT7
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT7_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT7_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_RXDPKTBUFDIS_EP7 \
    0x00000080 // EP7 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP6 \
    0x00000040 // EP6 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP5 \
    0x00000020 // EP5 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP4 \
    0x00000010 // EP4 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP3 \
    0x00000008 // EP3 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP2 \
    0x00000004 // EP2 RX Double-Packet Buffer
               // Disable
#define USB_RXDPKTBUFDIS_EP1 \
    0x00000002 // EP1 RX Double-Packet Buffer
               // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_TXDPKTBUFDIS_EP7 \
    0x00000080 // EP7 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP6 \
    0x00000040 // EP6 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP5 \
    0x00000020 // EP5 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP4 \
    0x00000010 // EP4 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP3 \
    0x00000008 // EP3 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP2 \
    0x00000004 // EP2 TX Double-Packet Buffer
               // Disable
#define USB_TXDPKTBUFDIS_EP1 \
    0x00000002 // EP1 TX Double-Packet Buffer
               // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CTO register.
//
//*****************************************************************************
#define USB_CTO_CCTV_M 0x0000FFFF // Configurable Chirp Timeout Value
#define USB_CTO_CCTV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_HHSRTN register.
//
//*****************************************************************************
#define USB_HHSRTN_HHSRTN_M \
    0x0000FFFF // HIgh Speed to UTM Operating
               // Delay
#define USB_HHSRTN_HHSRTN_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_HSBT register.
//
//*****************************************************************************
#define USB_HSBT_HSBT_M 0x0000000F // High Speed Timeout Adder
#define USB_HSBT_HSBT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LPMATTR register.
//
//*****************************************************************************
#define USB_LPMATTR_ENDPT_M 0x0000F000 // Endpoint
#define USB_LPMATTR_RMTWAK  0x00000100 // Remote Wake
#define USB_LPMATTR_HIRD_M  0x000000F0 // Host Initiated Resume Duration
#define USB_LPMATTR_LS_M    0x0000000F // Link State
#define USB_LPMATTR_LS_L1   0x00000001 // Sleep State (L1)
#define USB_LPMATTR_ENDPT_S 12
#define USB_LPMATTR_HIRD_S  4

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LPMCNTRL register.
//
//*****************************************************************************
#define USB_LPMCNTRL_NAK  0x00000010  // LPM NAK
#define USB_LPMCNTRL_EN_M 0x0000000C  // LPM Enable
#define USB_LPMCNTRL_EN_NONE \
    0x00000000                        // LPM and Extended transactions
                                      // are not supported. In this case,
                                      // the USB does not respond to LPM
                                      // transactions and LPM
                                      // transactions cause a timeout
#define USB_LPMCNTRL_EN_EXT \
    0x00000004                        // LPM is not supported but
                                      // extended transactions are
                                      // supported. In this case, the USB
                                      // does respond to an LPM
                                      // transaction with a STALL
#define USB_LPMCNTRL_EN_LPMEXT \
    0x0000000C                        // The USB supports LPM extended
                                      // transactions. In this case, the
                                      // USB responds with a NYET or an
                                      // ACK as determined by the value
                                      // of TXLPM and other conditions
#define USB_LPMCNTRL_RES   0x00000002 // LPM Resume
#define USB_LPMCNTRL_TXLPM 0x00000001 // Transmit LPM Transaction Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LPMIM register.
//
//*****************************************************************************
#define USB_LPMIM_ERR   0x00000020 // LPM Error Interrupt Mask
#define USB_LPMIM_RES   0x00000010 // LPM Resume Interrupt Mask
#define USB_LPMIM_NC    0x00000008 // LPM NC Interrupt Mask
#define USB_LPMIM_ACK   0x00000004 // LPM ACK Interrupt Mask
#define USB_LPMIM_NY    0x00000002 // LPM NY Interrupt Mask
#define USB_LPMIM_STALL 0x00000001 // LPM STALL Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LPMRIS register.
//
//*****************************************************************************
#define USB_LPMRIS_ERR   0x00000020 // LPM Interrupt Status
#define USB_LPMRIS_RES   0x00000010 // LPM Resume Interrupt Status
#define USB_LPMRIS_NC    0x00000008 // LPM NC Interrupt Status
#define USB_LPMRIS_ACK   0x00000004 // LPM ACK Interrupt Status
#define USB_LPMRIS_NY    0x00000002 // LPM NY Interrupt Status
#define USB_LPMRIS_LPMST 0x00000001 // LPM STALL Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LPMFADDR register.
//
//*****************************************************************************
#define USB_LPMFADDR_ADDR_M 0x0000007F // LPM Function Address
#define USB_LPMFADDR_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPC register.
//
//*****************************************************************************
#define USB_EPC_PFLTACT_M     0x00000300 // Power Fault Action
#define USB_EPC_PFLTACT_UNCHG 0x00000000 // Unchanged
#define USB_EPC_PFLTACT_TRIS  0x00000100 // Tristate
#define USB_EPC_PFLTACT_LOW   0x00000200 // Low
#define USB_EPC_PFLTACT_HIGH  0x00000300 // High
#define USB_EPC_PFLTAEN       0x00000040 // Power Fault Action Enable
#define USB_EPC_PFLTSEN_HIGH  0x00000020 // Power Fault Sense
#define USB_EPC_PFLTEN        0x00000010 // Power Fault Input Enable
#define USB_EPC_EPENDE        0x00000004 // EPEN Drive Enable
#define USB_EPC_EPEN_M \
    0x00000003                           // External Power Supply Enable
                                         // Configuration
#define USB_EPC_EPEN_LOW  0x00000000     // Power Enable Active Low
#define USB_EPC_EPEN_HIGH 0x00000001     // Power Enable Active High
#define USB_EPC_EPEN_VBLOW \
    0x00000002                           // Power Enable High if VBUS Low
                                         // (OTG only)
#define USB_EPC_EPEN_VBHIGH \
    0x00000003                           // Power Enable High if VBUS High
                                         // (OTG only)

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCRIS register.
//
//*****************************************************************************
#define USB_EPCRIS_PF 0x00000001 // USB Power Fault Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCIM register.
//
//*****************************************************************************
#define USB_EPCIM_PF 0x00000001 // USB Power Fault Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCISC register.
//
//*****************************************************************************
#define USB_EPCISC_PF \
    0x00000001 // USB Power Fault Interrupt Status
               // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRRIS register.
//
//*****************************************************************************
#define USB_DRRIS_RESUME 0x00000001 // RESUME Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRIM register.
//
//*****************************************************************************
#define USB_DRIM_RESUME 0x00000001 // RESUME Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRISC register.
//
//*****************************************************************************
#define USB_DRISC_RESUME \
    0x00000001 // RESUME Interrupt Status and
               // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GPCS register.
//
//*****************************************************************************
#define USB_GPCS_DEVMOD_M    0x00000007 // Device Mode
#define USB_GPCS_DEVMOD_OTG  0x00000000 // Use USB0VBUS and USB0ID pin
#define USB_GPCS_DEVMOD_HOST 0x00000002 // Force USB0VBUS and USB0ID low
#define USB_GPCS_DEVMOD_DEV  0x00000003 // Force USB0VBUS and USB0ID high
#define USB_GPCS_DEVMOD_HOSTVBUS \
    0x00000004                          // Use USB0VBUS and force USB0ID
                                        // low
#define USB_GPCS_DEVMOD_DEVVBUS \
    0x00000005                          // Use USB0VBUS and force USB0ID
                                        // high
#define USB_GPCS_DEVMODOTG 0x00000002   // Enable Device Mode
#define USB_GPCS_DEVMOD    0x00000001   // Device Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDC register.
//
//*****************************************************************************
#define USB_VDC_VBDEN 0x00000001 // VBUS Droop Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCRIS register.
//
//*****************************************************************************
#define USB_VDCRIS_VD 0x00000001 // VBUS Droop Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCIM register.
//
//*****************************************************************************
#define USB_VDCIM_VD 0x00000001 // VBUS Droop Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCISC register.
//
//*****************************************************************************
#define USB_VDCISC_VD \
    0x00000001 // VBUS Droop Interrupt Status and
               // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVRIS register.
//
//*****************************************************************************
#define USB_IDVRIS_ID \
    0x00000001 // ID Valid Detect Raw Interrupt
               // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVIM register.
//
//*****************************************************************************
#define USB_IDVIM_ID 0x00000001 // ID Valid Detect Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVISC register.
//
//*****************************************************************************
#define USB_IDVISC_ID \
    0x00000001 // ID Valid Detect Interrupt Status
               // and Clear

