fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMASEL register.
//
//*****************************************************************************
#define USB_DMASEL_DMACTX_M 0x00F00000 // DMA C TX Select
#define USB_DMASEL_DMACRX_M 0x000F0000 // DMA C RX Select
#define USB_DMASEL_DMABTX_M 0x0000F000 // DMA B TX Select
#define USB_DMASEL_DMABRX_M 0x00000F00 // DMA B RX Select
#define USB_DMASEL_DMAATX_M 0x000000F0 // DMA A TX Select
#define USB_DMASEL_DMAARX_M 0x0000000F // DMA A RX Select
#define USB_DMASEL_DMACTX_S 20
#define USB_DMASEL_DMACRX_S 16
#define USB_DMASEL_DMABTX_S 12
#define USB_DMASEL_DMABRX_S 8
#define USB_DMASEL_DMAATX_S 4
#define USB_DMASEL_DMAARX_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_PP register.
//
//*****************************************************************************
#define USB_PP_ECNT_M         0x0000FF00 // Endpoint Count
#define USB_PP_USB_M          0x000000C0 // USB Capability
#define USB_PP_USB_DEVICE     0x00000040 // DEVICE
#define USB_PP_USB_HOSTDEVICE 0x00000080 // HOST
#define USB_PP_USB_OTG        0x000000C0 // OTG
#define USB_PP_ULPI           0x00000020 // ULPI Present
#define USB_PP_PHY            0x00000010 // PHY Present
#define USB_PP_TYPE_M         0x0000000F // Controller Type
#define USB_PP_TYPE_0 \
    0x00000000                           // The first-generation USB
                                         // controller
#define USB_PP_TYPE_1 \
    0x00000001                           // Second-generation USB
                                         // controller.The controller
                                         // implemented in post Icestorm
                                         // devices that use the 3.0 version
                                         // of the Mentor controller
#define USB_PP_ECNT_S 8

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_PC register.
//
//*****************************************************************************
#define USB_PC_ULPIEN 0x00010000 // ULPI Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CC register.
//
//*****************************************************************************
#define USB_CC_CLKEN    0x00000200 // USB Clock Enable
#define USB_CC_CSD      0x00000100 // Clock Source/Direction
#define USB_CC_CLKDIV_M 0x0000000F // PLL Clock Divisor
#define USB_CC_CLKDIV_S 0

#endif // __HW_USB_H__
